# Урок 3. Данные, функции и модули в Python
# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# Пример:

# - [2, 3, 5, 9, 3] -> на нечётных индексы элементы 3 и 9, ответ: 12

# Решение 
#list = [2, 3, 5, 9, 3]
#summ = 0
#j = 0
#for i in list:
#    if j %2 != 0:
#        summ += i
#    j += 1
#print(summ)

# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент,
# второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
# Решение 
#list = [4, 8, 15, 16, 23, 42, 9]
#k = len(list)
#new_list = []
#j = 0
#for i in list:
#    k -= 1
#    if i == list[k]:
#        new_list.insert(j, i * i) 
#        break
#    new_list.insert(j, i * list[k])
#    j += 1
#print(new_list)

# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу
# между максимальным и минимальным значением дробной части элементов.

# Пример:

# - [1.1, 1.2, 3.1, 10.01] => 0.19
# Решение
# list = [1.1, 1.2, 3.1, 10.01]
# j = 0
# k = 0
# new_list = []
# thrid_list = []
# for i in list:
#     new_list.insert(j, round(i, 0))
#     j += 1
# for i in list:
#     #thrid_list[k] = list[k] - new_list[k]
#     thrid_list.insert(k, round(list[k] - new_list[k], 2))
#     k += 1
# max = thrid_list[0]
# min = thrid_list[0]
# for i in thrid_list:
#     if max < i:
#         max = i
#     if min > i:
#         min = i
# print(max - min)



